#ifndef _PIT_H_
#define _PIT_H_

   //1、头文件
   #include"common.h"
   
   //2、宏定义
   
   //3、函数声明

    //==========================================================================
    //函数名:     void hw_pit_init(uint8 pitno,uint32 timeout)
    //功能:       配置pit定时器
    //入口参数:   pitno:  表示pit通道号。  
    //            timeout:表示定时溢出开始递减的值
    //出口参数:   无
    //说明:       无       
    //==========================================================================
    void hw_pit_init(uint8 pitno,uint32 timeout);

    //==========================================================================
    //函数名:    void enable_pit_interrupt(uint8 pitno)  
    //功能:      开接收引脚的IRQ中断
    //入口参数:  pitno: 表示pit通道号 
    //出口参数:  无
    //说明:      无                                                                                                     
    //==========================================================================
    void enable_pit_interrupt(uint8 pitno);
    
    //==========================================================================
    //函数名:   void disable_pit_interrupt(uint8 pitno)
    //功能:     开接收引脚的IRQ中断 
    //入口参数: pitno: 表示pit通道号                                             
    //出口参数: 无  
    //说明:     无                                                                                                    
    //==========================================================================
    void disable_pit_interrupt(uint8 pitno);
    
#endif